app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" ORDER BY "emails"."created_at" ASC
---
  def index
    @emails = Email.all

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-08-27 07:31:10.381314"], ["id", 1]]
---
  def show
    @email = Email.find(params[:id])
    @email.update(read: true)

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @email = Email.new(object: Faker::Book.title, body: Faker::Lorem.paragraph)

    if @email.save

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2020-08-27 09:08:41.577957"], ["id", 23]]
---
  def update
    @email = Email.find(params[:id])
    @email.toggle(:read).save

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 22]]
---
  def destroy
    @email = Email.find(params[:id])
    @email.destroy